const api = {
    harbor: {
        all(callback) {
            const harbors = [
                {
                    seq: 398,
                    place: "제주장 국제 여객 터미널",
                    lat: 33.52456237850086,
                    lng: 126.54371888191963,
                },
                {
                    seq: 399,
                    place: "통영항",
                    lat: 34.83952733985843,
                    lng: 128.42015935198992,
                },
                {
                    seq: 400,
                    place: "부산 국제 크루즈 터미널",
                    lat: 35.07980714092641,
                    lng: 129.0798233676466
                },
                {
                    seq: 401,
                    place: "여수 연안 여객 터미널",
                    lat: 34.73912218990838,
                    lng: 127.7326117746759,
                },
                {
                    seq: 402,
                    place: "목포 연안 여객 터미널",
                    lat: 34.78242103832617,
                    lng: 126.38379614665682,
                },
                {
                    seq: 403,
                    place: "구산항 연안 여객 터미널",
                    lat: 35.97769454696543,
                    lng: 126.63282769595156,
                },
                {
                    seq: 404,
                    place: "인천항 연안 여객 터미널",
                    lat: 37.45340487975725,
                    lng: 126.59951650605112,
                },
            ];
            callback({ success: true, harbors });
        }
    }
}

export default api;